{
  "backend/main.mo": "Main Motoko actor for the Digital Forge ICP platform, handling access control initialization, token creation with payment validation, rate limiting, tax configuration, and HTTP outcalls to Stripe. Defines constants for fees, treasury addresses, and enforces a hardcoded permanent admin principal.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, describing each component's purpose, key features, and notable implementation details.",
  "frontend/index.html": "Root HTML entry point for the Digital Forge ICP frontend, mounting the React app into a div with id 'root' and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React application component that manages view routing across five pages (home, create, dashboard, forged, lookup), handles authentication state via Internet Identity, and conditionally renders the ProfileSetupModal for new users.",
  "frontend/src/components/BuyMeACoffee.tsx": "Inline donation component that fetches the treasury ICP address and displays an expandable panel with a copy-to-clipboard button for sending donations.",
  "frontend/src/components/Footer.tsx": "Site footer with Digital Forge branding, navigation links, and an embedded BuyMeACoffee support section, styled with the forge OKLCH color theme.",
  "frontend/src/components/Header.tsx": "Sticky navigation header featuring the Digital Forge logo, auth-gated nav items, Internet Identity login/logout, a WalletButton for Web3 wallet connection, and a responsive mobile menu.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog component that collects and saves a new user's profile (name, username, email) using Internet Identity authentication, with form validation and mutation via `useSaveCallerUserProfile`.",
  "frontend/src/components/WalletButton.tsx": "A UI button component that handles Plug wallet connection states (detecting, not installed, disconnected, connected) and provides a dropdown menu with copy address, reconnect, and disconnect actions.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using the current Internet Identity, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook that manage DFINITY AuthClient lifecycle, login/logout, and identity state persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for all backend interactions including user profile CRUD, token listing/creation/management, and platform stats, with toast notifications for mutation outcomes.",
  "frontend/src/hooks/useWallet.ts": "A React hook that manages Plug wallet detection, connection, auto-reconnect, and ICP transfer operations, exposing wallet state and helper functions with timeout handling and session storage persistence.",
  "frontend/src/index.css": "Defines the global CSS for the app using Tailwind, importing Google Fonts (Rajdhani, Orbitron, Inter) and establishing a dark 'forge' theme with OKLCH color tokens, custom utility classes for gradients, glow effects, and forge-branded card/button styles.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider (React Query) and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/CreateTokenWizard.tsx": "Multi-step wizard page for creating a new ICP token, handling form state for token metadata, tax module configuration, and media/meta fields, with payment verification and backend mutation hooks.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page displaying the authenticated user's tokens, activity metrics, and global platform stats, with token cards showing supply, tax rates, and status badges.",
  "frontend/src/pages/ForgedTokens.tsx": "Community explorer page that lists all forged tokens with search/filter functionality, displaying each token's supply, tax rates, modules, and canister ID via cards.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page featuring a hero section, feature highlights, and a step-by-step guide for forging tokens, with wallet-connection gating for the forge action.",
  "frontend/src/pages/TokenLookup.tsx": "React page component that lets users search for a deployed token by canister ID, calls the backend `lookupToken` actor method, and displays the returned TokenMetadata (status, supply, tax rates, dates) with copy-to-clipboard support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with forge/metallurgy-specific color tokens, custom fonts (Inter, Rajdhani, Orbitron), glow box-shadows, gradient background images, and keyframe animations for the dark forge visual theme.",
  "project_state.json": "Project state manifest (version 19) documenting the Digital Forge ICP token factory architecture, known issues (transient keyword, frontend/backend mismatches), and a list of existing implemented features with their requirement IDs."
}