{
  "backend/main.mo": "Main Motoko actor for the Digital Forge ICP platform, handling access control initialization, token creation with payment validation, rate limiting, tax configuration, and HTTP outcalls for Stripe integration and blob storage.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, describing their roles in the Digital Forge ICP token creation platform.",
  "frontend/index.html": "Minimal HTML entry point for the React app, setting the page title to 'Digital Forge ICP Token Creation Platform' and mounting the app at the root div.",
  "frontend/src/App.tsx": "Root React component that manages view routing across five pages (home, create, dashboard, forged, lookup), authentication state via Internet Identity, and conditionally renders the ProfileSetupModal for new users.",
  "frontend/src/components/BuyMeACoffee.tsx": "Inline donation component that fetches the treasury ICP address, toggles an expandable address display, and provides a copy-to-clipboard button with visual feedback.",
  "frontend/src/components/Footer.tsx": "Site footer with Digital Forge branding, navigation links to all views, and an embedded BuyMeACoffee support section with forge-themed styling.",
  "frontend/src/components/Header.tsx": "Sticky navigation header featuring the Digital Forge logo, auth-gated nav items, Internet Identity login/logout, and a WalletButton for Web3 wallet connection with a responsive mobile menu.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog component that collects name, username, and email to create a user profile, validating inputs and saving via the `useSaveCallerUserProfile` mutation. Requires an authenticated Internet Identity before allowing submission.",
  "frontend/src/components/WalletButton.tsx": "A UI button component that handles Plug wallet connection states (detecting, not installed, disconnected, connected), showing appropriate actions like install link, connect button, or a dropdown with address copy and disconnect options.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using the current Internet Identity, initializing access control for authenticated users and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing ICP Internet Identity authentication, including login, logout, and persisted identity state via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile CRUD, token listing/fetching/creation, and other platform data, with toast notifications for mutation outcomes.",
  "frontend/src/hooks/useWallet.ts": "A hook managing Plug wallet detection, connection, disconnection, and auto-reconnect logic, exposing wallet state (address, principal, connection status) and transfer utilities with timeout handling.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, sets up Tailwind directives, and defines a dark 'Dark Forge' theme with OKLCH CSS variables, custom utility classes for gradients, glow effects, and forge-specific design tokens.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/CreateTokenWizard.tsx": "Multi-step wizard page for creating ICP tokens, handling form state for token configuration (name, supply, tax modules, media), payment verification, and submission via backend query hooks.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page that displays a user's forged tokens, activity metrics, and global platform stats using React Query hooks, with token cards showing supply, tax rates, and status.",
  "frontend/src/pages/ForgedTokens.tsx": "Community explorer page that lists all forged tokens with search/filter functionality, displaying each token's supply, buy/sell tax, active modules, and canister ID via the useGetForgedTokens hook.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page showcasing platform features, a step-by-step how-it-works section, and a hero CTA that gates navigation to token creation behind wallet connection.",
  "frontend/src/pages/TokenLookup.tsx": "React page component that lets users search for a deployed token by canister ID, calls the backend `lookupToken` actor method, and displays the returned TokenMetadata (status, supply, tax rates, dates) with copy-to-clipboard support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with forge/metallurgy-specific color tokens, custom fonts (Inter, Rajdhani, Orbitron), box shadows, background gradients, and keyframe animations for the Digital Forge UI.",
  "project_state.json": "Project state snapshot (version 21) documenting the Digital Forge ICP token factory architecture, known issues (transient keyword, frontend/backend mismatches), existing features, and fix requests for the Motoko backend and React frontend."
}