{
  "backend/main.mo": "Main Motoko actor for the Digital Forge ICP platform, handling access control initialization, token creation with payment validation, rate limiting, input sanitization, and treasury fee enforcement.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing their purpose and key implementation details.",
  "frontend/index.html": "Minimal HTML entry point for the React app, mounting the root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component managing view routing across five pages, authentication state, profile setup modal display, and global providers (theme, query client, toaster).",
  "frontend/src/components/BuyMeACoffee.tsx": "Inline donation component that fetches the treasury address, toggles an expandable wallet address display, and provides copy-to-clipboard functionality.",
  "frontend/src/components/Footer.tsx": "Site footer with Digital Forge branding, navigation links, and an embedded BuyMeACoffee support section.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with the Digital Forge logo, auth-gated nav items, Internet Identity login/logout, and a mobile hamburger menu.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog component that collects and saves a new user's profile (name, username, email) using Internet Identity authentication, with form validation and mutation via `useSaveCallerUserProfile`.",
  "frontend/src/components/WalletButton.tsx": "A UI button component that handles Plug wallet connection states (detecting, not installed, disconnected, connected) and provides a dropdown menu for copying address, viewing on explorer, reconnecting, or disconnecting.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using the current Internet Identity, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook that manage DFINITY AuthClient lifecycle, login/logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for all backend interactions including user profile CRUD, token listing/fetching/creation, and related mutations with toast notifications.",
  "frontend/src/hooks/useWallet.ts": "A React hook that manages Plug wallet detection, connection, auto-reconnect, session persistence, and ICP transfer operations with timeout handling and debug logging.",
  "frontend/src/index.css": "Defines the global CSS for the app using Tailwind, importing Google Fonts and establishing a dark 'Dark Forge' theme with OKLCH color tokens, custom forge-specific utility classes (gradients, glows, cards), and base typography styles.",
  "frontend/src/main.tsx": "Entry point that renders the React app with QueryClientProvider for data fetching and InternetIdentityProvider for authentication wrapping the root App component.",
  "frontend/src/pages/CreateTokenWizard.tsx": "A multi-step wizard page for creating ICP tokens, handling form state for token configuration (basic info, tax modules, media/meta), payment verification, and submission via backend query hooks.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page displaying the authenticated user's tokens, activity metrics, and global platform stats, with token cards showing supply, tax, and status information.",
  "frontend/src/pages/ForgedTokens.tsx": "Community explorer page that lists all forged tokens with search/filter functionality, displaying each token's supply, tax rates, modules, and canister details in card format.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page showcasing platform features and a step-by-step guide for forging tokens, with a hero section and wallet-connection-gated navigation to the token creation wizard.",
  "frontend/src/pages/TokenLookup.tsx": "React page component that lets users search for a deployed token by canister ID, displays token metadata (status, supply, tax rates, dates), and supports clipboard copy of key fields.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with forge/metallurgy-inspired design tokens including custom colors, fonts (Inter, Rajdhani, Orbitron), box shadows, gradients, and keyframe animations.",
  "project_state.json": "Project state document describing the Digital Forge ICP token factory platform architecture, known issues (transient keyword, frontend/backend mismatches), existing features, and fix requests at schema version 1.0.0."
}