{
  "kind": "build_request",
  "title": "Hardcode correct treasury principal and permanent admin in backend/main.mo",
  "projectName": "Digital Forge",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "In backend/main.mo, replace every occurrence of the hex string 'ab6f9d02f1930037c53b781620754e804b140732f0990cc252fc604915303936' (and any substring such as 'ab6f9d02') with the ICP principal 'iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae'. This must cover: the treasuryAddress constant/variable declaration, the body of getTreasuryAddress(), the body of getBuyMeACoffeeAddress(), any inline comments, and any other location in the file. After the change, zero occurrences of the substring 'ab6f9d02' must remain anywhere in the file.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Replace the ENTIRE function with this exact code: public query func getTreasuryAddress() : async Text { \"iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae\" };",
          "Do a final search across the entire file for \"ab6f9d02\" — if ANY remain, replace them with \"iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae\""
        ]
      },
      "acceptanceCriteria": [
        "getTreasuryAddress() returns exactly 'iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae'",
        "getBuyMeACoffeeAddress() returns exactly 'iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae'",
        "The treasuryAddress constant is declared as: private let treasuryAddress : Text = \"iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae\"",
        "Zero occurrences of the substring 'ab6f9d02' exist anywhere in backend/main.mo"
      ]
    },
    {
      "id": "REQ-20",
      "text": "In backend/main.mo, replace every occurrence of the hex string 'f2ba368dff8966e6a9977354eb4c3f0f543c3cadb504dc0d4355859888bd2256' (and any substring such as 'f2ba368d') with the ICP principal 'iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae'. This must cover the developerAddress constant/variable declaration, any function bodies, inline comments, and any other location in the file. After the change, zero occurrences of the substring 'f2ba368d' must remain anywhere in the file.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Find any constant or variable for the developer address. It probably stores \"f2ba368dff8966e6a9977354eb4c3f0f543c3cadb504dc0d4355859888bd2256\". Replace it with: private let developerAddress : Text = \"iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae\";",
          "Same for \"f2ba368d\""
        ]
      },
      "acceptanceCriteria": [
        "The developerAddress constant is declared as: private let developerAddress : Text = \"iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae\"",
        "Zero occurrences of the substring 'f2ba368d' exist anywhere in backend/main.mo"
      ]
    },
    {
      "id": "REQ-21",
      "text": "In backend/main.mo, hardcode the principal 'r7e75-6gjbk-2hu53-tcwcn-gppkv-2prfn-os6xt-eocak-oy4sa-qnejo-kae' as a permanent admin. This principal must be assigned the admin role wherever initializeAccessControl sets up admin roles (or in the actor's initialization block), must survive upgrades and re-deployments, and must not be removable through any access control function. Existing roles and access control assignments must not be disturbed.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Add this principal as admin wherever initializeAccessControl sets up admin roles: r7e75-6gjbk-2hu53-tcwcn-gppkv-2prfn-os6xt-eocak-oy4sa-qnejo-kae"
        ]
      },
      "acceptanceCriteria": [
        "Principal 'r7e75-6gjbk-2hu53-tcwcn-gppkv-2prfn-os6xt-eocak-oy4sa-qnejo-kae' is assigned the admin role at actor initialization",
        "The assignment is present as a hardcoded entry and cannot be removed by any runtime access control call",
        "All existing access control assignments and other admin principals remain untouched"
      ]
    },
    {
      "id": "REQ-22",
      "text": "Verify that all other critical constants and functionality in backend/main.mo remain completely unchanged after applying REQ-19 through REQ-21: MINT_FEE_AMOUNT=1_000_000_000, MIN_TOTAL_TAX=25, MAX_TOTAL_TAX=2500, PAYMENT_VALIDITY_WINDOW=3_600_000_000_000, TOKEN_CREATION_RATE_LIMIT=30_000_000_000, all six tax mechanisms (treasury, burn, reflection, liquidity, yield, support), x404 payment rails (150 BPS additive), ICRC-2 approve/transferFrom fee collection, rate limiting, input sanitization, getTokenCount(), getTreasuryAddress(), getCreationFee(), getAllTokens(), and the transient-keyword fix (non-stable var declarations for paymentLockMap and creationTimeMap).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Deploy. Do not regenerate the file. Deploy the patched version as-is."
        ]
      },
      "acceptanceCriteria": [
        "MINT_FEE_AMOUNT equals 1_000_000_000",
        "MIN_TOTAL_TAX equals 25 and MAX_TOTAL_TAX equals 2500",
        "PAYMENT_VALIDITY_WINDOW equals 3_600_000_000_000 and TOKEN_CREATION_RATE_LIMIT equals 30_000_000_000",
        "All six tax mechanisms compile and are present",
        "getTokenCount(), getTreasuryAddress(), getCreationFee(), and getAllTokens() are all present and callable",
        "No use of the transient keyword remains in the file",
        "The backend actor compiles and deploys successfully"
      ]
    }
  ],
  "constraints": [
    "Do NOT regenerate backend/main.mo from scratch or from any template — only apply targeted find-and-replace patches to the existing file",
    "Zero occurrences of 'ab6f9d02' or 'f2ba368d' as substrings must remain in the final file",
    "The permanent admin principal 'r7e75-6gjbk-2hu53-tcwcn-gppkv-2prfn-os6xt-eocak-oy4sa-qnejo-kae' must not be removable at runtime",
    "All existing logic, constants, tax mechanisms, and payment rails must be fully preserved"
  ],
  "nonGoals": [
    "Frontend changes of any kind",
    "Changes to any constants other than the hex address strings being replaced",
    "Restructuring or refactoring any backend logic beyond the specified patches",
    "Adding new features or functions beyond those already present"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}