{
  "kind": "build_request",
  "title": "Hard-replace all hex treasury strings in backend/main.mo with correct ICP principal",
  "projectName": "Digital Forge ICP",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "In backend/main.mo, perform an exhaustive search-and-replace of EVERY occurrence of the hex string 'ab6f9d02f1930037c53b781620754e804b140732f0990cc252fc604915303936' (and any substring or shortened form such as 'ab6f9d02') with the ICP principal 'iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae'. This covers constants, variable initializers, function bodies (getTreasuryAddress, getBuyMeACoffeeAddress, and any other function), default values, and inline comments. Zero instances of 'ab6f9d02' as a substring must remain anywhere in the file after this change.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "search for this exact text: ab6f9d02f1930037c53b781620754e804b140732f0990cc252fc604915303936 And replace it with this exact text: iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae",
          "Do 'Replace All' so every single instance is caught."
        ]
      },
      "acceptanceCriteria": [
        "A grep/search of backend/main.mo for 'ab6f9d02' returns zero matches",
        "A grep/search of backend/main.mo for 'ab6f9d02f1930037c53b781620754e804b140732f0990cc252fc604915303936' returns zero matches",
        "getTreasuryAddress() returns 'iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae' after deploy",
        "All other constants and logic (MINT_FEE_AMOUNT, tax mechanisms, payment rails, access control) remain unchanged"
      ]
    },
    {
      "id": "REQ-18",
      "text": "In backend/main.mo, perform an exhaustive search-and-replace of EVERY occurrence of the hex string 'f2ba368dff8966e6a9977354eb4c3f0f543c3cadb504dc0d4355859888bd2256' (and any substring or shortened form such as 'f2ba368d') with the ICP principal 'iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae'. This covers constants, variable initializers, function bodies, default values, and inline comments. Zero instances of 'f2ba368d' as a substring must remain anywhere in the file after this change.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Do the same for this text: f2ba368dff8966e6a9977354eb4c3f0f543c3cadb504dc0d4355859888bd2256 Replace all with the same: iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae"
        ]
      },
      "acceptanceCriteria": [
        "A grep/search of backend/main.mo for 'f2ba368d' returns zero matches",
        "A grep/search of backend/main.mo for 'f2ba368dff8966e6a9977354eb4c3f0f543c3cadb504dc0d4355859888bd2256' returns zero matches",
        "All other constants and logic remain unchanged",
        "The file compiles without errors after the replacement"
      ]
    }
  ],
  "constraints": [
    "Do NOT rewrite or regenerate backend/main.mo from scratch — only perform targeted find-and-replace on the two specified hex strings",
    "Do not modify any other logic, constants, function signatures, tax mechanisms, payment rails, or access control code",
    "MINT_FEE_AMOUNT=1_000_000_000, MIN_TOTAL_TAX=25, MAX_TOTAL_TAX=2500, PAYMENT_VALIDITY_WINDOW=3_600_000_000_000, TOKEN_CREATION_RATE_LIMIT=30_000_000_000 must remain unchanged",
    "The hardcoded admin principal 'r7e75-6gjbk-2hu53-tcwcn-gppkv-2prfn-os6xt-eocak-oy4sa-qnejo-kae' must remain intact",
    "No frontend changes required for this build"
  ],
  "nonGoals": [
    "Rebuilding or regenerating backend/main.mo from a template",
    "Changing any frontend files",
    "Modifying any access control, tax, payment, or rate-limiting logic",
    "Adding new features or query functions"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}