{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 21,
  "summary": "Digital Forge ICP — A token factory platform on the Internet Computer. Single-file Motoko backend (1,819 lines) creates ForgedToken canisters on demand via IC Management Canister, collects fees via ICRC-2 approve/transferFrom on the ICP ledger, implements 6 tax mechanisms (treasury, burn, reflection, liquidity, yield, support), x404 payment rails (150 BPS additive), inline access control, rate limiting, and input sanitization. Treasury: iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae.",
  "architectural_notes": [
    "Single-file Motoko backend (backend/main.mo) — no external modules, only mo:base imports",
    "Token factory creates ForgedToken canisters via IC Management Canister (aaaaa-aa)",
    "Fee collection via ICRC-2 transferFrom on ICP ledger (ryjl3-tyaaa-aaaaa-aaaba-cai)",
    "x404 payment rails: 150 BPS additive fee on all operations forwarded to treasury",
    "6 tax mechanisms: treasury, burn, reflection, liquidity, yield, support (max 25% total buy or sell)",
    "Hardcoded treasury: iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae",
    "Transient HashMaps serialized to persistent arrays in preupgrade/postupgrade hooks",
    "Token Wasm uploaded post-deploy via chunked upload (startWasmUpload/uploadWasmChunk/finalizeWasmUpload)",
    "Inline access control with admin/user/guest roles; guests auto-promoted to user on profile save",
    "Rate limiting on token creation (30s), payments (5s), views (1min), comments (10s)"
  ],
  "known_issues": [
    "`transient` keyword is non-standard Motoko and must be adapted to standard stable/non-stable variable patterns to compile",
    "Frontend getForgedTokens() call returns undefined/non-array — mismatch between frontend actor call and backend function name or return format",
    "getTreasuryAddress() persistently returns old hex string 'ab6f9d02...' across 5+ deploys — hex string may be regenerated from a template/spec on every build, not just in main.mo source"
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-ensure-the-frontend-app-tsx-routing-covers-all-five-views-home-create-dashboard-forged-lookup-and-that-all-react-query-hooks-in-usequeries-ts-correctly-map-to-the-updated-backend-actor-interface-after-the-transient-fix-no-function-signatures-should-have-changed-so-verify-hook-calls-match-backend-public-methods",
      "title": "Ensure the frontend App.tsx routing covers all five views (home, create, dashboard, forged, lookup) and that all React Query hooks in useQueries.ts correctly map to the updated backend actor interface after the transient fix. No function signatures should have changed, so verify hook calls match backend public methods.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-apply-a-dark-forge-metallurgy-inspired-visual-theme-consistently-across-all-pages-deep-charcoal-and-obsidian-backgrounds-molten-orange-and-amber-accent-colors-for-ctas-and-highlights-steel-grey-typography-anvil-flame-motif-influences-in-section-headers-and-cards-ensure-the-theme-is-coherent-across-header-footer-homepage-hero-dashboard-stats-cards-forgedtokens-list-createtokenwizard-steps-and-tokenlookup-page",
      "title": "Apply a dark forge/metallurgy-inspired visual theme consistently across all pages: deep charcoal and obsidian backgrounds, molten orange and amber accent colors for CTAs and highlights, steel-grey typography, anvil/flame motif influences in section headers and cards. Ensure the theme is coherent across Header, Footer, HomePage hero, Dashboard stats cards, ForgedTokens list, CreateTokenWizard steps, and TokenLookup page.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-in-tokenlookup-tsx-change-the-search-input-placeholder-text-from-0x-to-xxxxx-xxxxx-xxxxx-xxxxx-cai-to-reflect-icp-canister-id-format-instead-of-evm-address-format",
      "title": "In TokenLookup.tsx, change the search input placeholder text from '0x...' to 'xxxxx-xxxxx-xxxxx-xxxxx-cai' to reflect ICP canister ID format instead of EVM address format.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-fix-the-tokens-data-is-not-an-array-undefined-console-error-on-the-forged-tokens-page-audit-the-usegetforgedtokens-hook-in-usequeries-ts-to-confirm-the-actor-call-matches-the-exact-backend-public-method-name-if-the-backend-exposes-a-differently-named-function-e-g-listforgedtokens-getalltokens-gettokens-update-the-frontend-call-to-match-also-ensure-the-response-is-correctly-unwrapped-if-the-backend-returns-a-variant-result-or-nested-object-rather-than-a-bare-array-add-the-appropriate-unwrapping-logic-before-passing-data-to-the-forgedtokens-page-component",
      "title": "Fix the 'Tokens data is not an array: undefined' console error on the Forged Tokens page. Audit the useGetForgedTokens hook in useQueries.ts to confirm the actor call matches the exact backend public method name. If the backend exposes a differently named function (e.g. listForgedTokens, getAllTokens, getTokens), update the frontend call to match. Also ensure the response is correctly unwrapped — if the backend returns a variant, Result, or nested object rather than a bare array, add the appropriate unwrapping logic before passing data to the ForgedTokens page component.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "feature-on-the-forge-a-token-button-present-in-homepage-tsx-and-any-other-location-where-it-appears-when-no-wallet-is-connected-display-a-visible-inline-message-or-tooltip-reading-connect-wallet-to-forge-tokens-instead-of-silently-doing-nothing-the-button-should-remain-visible-but-indicate-the-wallet-requirement-clearly-to-the-user",
      "title": "On the 'Forge a Token' button (present in HomePage.tsx and any other location where it appears), when no wallet is connected, display a visible inline message or tooltip reading 'Connect wallet to forge tokens' instead of silently doing nothing. The button should remain visible but indicate the wallet requirement clearly to the user.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "feature-in-frontend-src-hooks-usequeries-ts-add-react-query-hooks-for-the-three-new-backend-query-functions-usegettokencount-usegettreasuryaddress-and-usegetcreationfee-ensure-they-call-the-corresponding-actor-methods-and-handle-anonymous-actor-access-correctly",
      "title": "In frontend/src/hooks/useQueries.ts, add React Query hooks for the three new backend query functions: useGetTokenCount(), useGetTreasuryAddress(), and useGetCreationFee(). Ensure they call the corresponding actor methods and handle anonymous actor access correctly.",
      "reqIds": [
        "REQ-12"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Adapt the existing backend/main.mo DigitalForgeICP actor so it compiles correctly on the Internet Computer by replacing all `transient` keyword usages (on paymentLockMap/paymentLocks and creationTimeMap/lastTokenCreation HashMaps) with standard non-stable var declarations, preserving all existing logic: access control initialization, token creation with fee validation and rate limiting, payment recording/verification, blob storage mixins, 6 tax mechanisms (treasury, burn, reflection, liquidity, yield, support), x404 payment rails (150 BPS additive), inline access control, and input sanitization. Treasury address: iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae. Keep all constants (MINT_FEE_AMOUNT=1_000_000_000, MIN_TOTAL_TAX=25, MAX_TOTAL_TAX=2500, PAYMENT_VALIDITY_WINDOW=3_600_000_000_000, TOKEN_CREATION_RATE_LIMIT=30_000_000_000) intact.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Fix 'Tokens data is not an array: undefined' error on Forged Tokens page — ensure frontend getForgedTokens() actor call matches backend function name and handles returned data structure correctly",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Show 'Connect wallet to forge tokens' message on the Forge a Token button when no wallet is connected, instead of silently doing nothing",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "Fix initializeAccessControl() lock — allow treasury principal to force-add themselves as admin without wiping existing roles, even if already initialized",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-8",
      "summary": "Make getAllTokens() accessible to anonymous/unregistered callers — remove registration gate from all public token read functions",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-9",
      "summary": "Add missing backend query functions: getTokenCount() returns Nat, getTreasuryAddress() returns Text, getCreationFee() returns Nat",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-12",
      "summary": "In backend/main.mo, modify initializeAccessControl() so that if the caller is the treasury principal (\"iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae\"), they can force-add themselves as admin even after the function has already been called once. Do NOT reset or wipe any existing roles — only add the treasury principal to the admin role if they are not already present. All other existing access control assignments must remain untouched.",
      "reqIds": [
        "REQ-9"
      ],
      "status": "pending"
    },
    {
      "id": "AR-13",
      "summary": "In backend/main.mo, remove the registration gate from getAllTokens() (and any other public token read functions). getAllTokens() must return the full token list to any caller, including anonymous and unregistered principals, without requiring prior registration or profile creation.",
      "reqIds": [
        "REQ-10"
      ],
      "status": "pending"
    },
    {
      "id": "AR-14",
      "summary": "In backend/main.mo, add three missing public query functions: getTokenCount() returns the total count of registered tokens as Nat; getTreasuryAddress() returns the treasury principal as Text; getCreationFee() returns the mint fee amount as Nat.",
      "reqIds": [
        "REQ-11"
      ],
      "status": "pending"
    },
    {
      "id": "AR-15",
      "summary": "In backend/main.mo, perform a clean consolidated rewrite that eliminates every occurrence of the hex string 'ab6f9d02f1930037c53b781620754e804b140732f0990cc252fc604915303936' and every occurrence of 'f2ba368dff8966e6a9977354eb4c3f0f543c3cadb504dc0d4355859888bd2256'. Both strings must be replaced with the ICP principal 'iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae' wherever they appear — in constants, default values, function bodies (getTreasuryAddress, getBuyMeACoffeeAddress, and any other location), inline comments, or variable initializers. After the rewrite, zero instances of 'ab6f9d02' or 'f2ba368d' (as substrings) must remain anywhere in the file.",
      "reqIds": [
        "REQ-13"
      ],
      "status": "pending"
    },
    {
      "id": "AR-16",
      "summary": "In backend/main.mo, hardcode the principal 'r7e75-6gjbk-2hu53-tcwcn-gppkv-2prfn-os6xt-eocak-oy4sa-qnejo-kae' as a permanent admin. This principal must be assigned the admin role at actor initialization and must not be removable through any access control function. The hardcoded admin assignment must survive upgrades and re-deployments.",
      "reqIds": [
        "REQ-14"
      ],
      "status": "pending"
    },
    {
      "id": "AR-17",
      "summary": "Ensure the consolidated rewrite of backend/main.mo preserves all existing functionality without regression: MINT_FEE_AMOUNT=1_000_000_000, MIN_TOTAL_TAX=25, MAX_TOTAL_TAX=2500, PAYMENT_VALIDITY_WINDOW=3_600_000_000_000, TOKEN_CREATION_RATE_LIMIT=30_000_000_000 constants must remain unchanged; all six tax mechanisms (treasury, burn, reflection, liquidity, yield, support) must remain intact; x404 payment rails (150 BPS additive) must remain intact; ICRC-2 approve/transferFrom fee collection must remain intact; rate limiting and input sanitization must remain intact; all previously added query functions (getTokenCount, getTreasuryAddress, getCreationFee, getAllTokens) must remain present and functional; the transient keyword fix (replacing transient with standard non-stable var declarations) applied in earlier builds must be preserved.",
      "reqIds": [
        "REQ-15"
      ],
      "status": "pending"
    },
    {
      "id": "AR-18",
      "summary": "In backend/main.mo, perform a complete search-and-replace of every occurrence of the hex strings 'ab6f9d02f1930037c53b781620754e804b140732f0990cc252fc604915303936' and 'f2ba368dff8966e6a9977354eb4c3f0f543c3cadb504dc0d4355859888bd2256' (and any substring thereof, including shortened versions like 'ab6f9d02' or 'f2ba368d') with the ICP principal 'iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae'. This replacement must cover every location in the file: constants, variable initializers, function bodies (getTreasuryAddress, getBuyMeACoffeeAddress, and any other function), default values, and inline comments. After the rewrite, zero instances of either hex string (or their substrings) must remain anywhere in backend/main.mo. All other logic, constants (MINT_FEE_AMOUNT=1_000_000_000, MIN_TOTAL_TAX=25, MAX_TOTAL_TAX=2500, PAYMENT_VALIDITY_WINDOW=3_600_000_000_000, TOKEN_CREATION_RATE_LIMIT=30_000_000_000), tax mechanisms, payment rails, access control, rate limiting, and query functions must remain completely unchanged.",
      "reqIds": [
        "REQ-16"
      ],
      "status": "pending"
    },
    {
      "id": "AR-19",
      "summary": "In backend/main.mo, perform an exhaustive search-and-replace of EVERY occurrence of the hex string 'ab6f9d02f1930037c53b781620754e804b140732f0990cc252fc604915303936' (and any substring or shortened form such as 'ab6f9d02') with the ICP principal 'iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae'. This covers constants, variable initializers, function bodies (getTreasuryAddress, getBuyMeACoffeeAddress, and any other function), default values, and inline comments. Zero instances of 'ab6f9d02' as a substring must remain anywhere in the file after this change.",
      "reqIds": [
        "REQ-17"
      ],
      "status": "pending"
    },
    {
      "id": "AR-20",
      "summary": "In backend/main.mo, perform an exhaustive search-and-replace of EVERY occurrence of the hex string 'f2ba368dff8966e6a9977354eb4c3f0f543c3cadb504dc0d4355859888bd2256' (and any substring or shortened form such as 'f2ba368d') with the ICP principal 'iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae'. This covers constants, variable initializers, function bodies, default values, and inline comments. Zero instances of 'f2ba368d' as a substring must remain anywhere in the file after this change.",
      "reqIds": [
        "REQ-18"
      ],
      "status": "pending"
    },
    {
      "id": "AR-21",
      "summary": "In backend/main.mo, replace every occurrence of the hex string 'ab6f9d02f1930037c53b781620754e804b140732f0990cc252fc604915303936' (and any substring such as 'ab6f9d02') with the ICP principal 'iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae'. This must cover: the treasuryAddress constant/variable declaration, the body of getTreasuryAddress(), the body of getBuyMeACoffeeAddress(), any inline comments, and any other location in the file. After the change, zero occurrences of the substring 'ab6f9d02' must remain anywhere in the file.",
      "reqIds": [
        "REQ-19"
      ],
      "status": "pending"
    },
    {
      "id": "AR-22",
      "summary": "In backend/main.mo, replace every occurrence of the hex string 'f2ba368dff8966e6a9977354eb4c3f0f543c3cadb504dc0d4355859888bd2256' (and any substring such as 'f2ba368d') with the ICP principal 'iyupi-26e6a-z56ra-6a5tz-yyj6i-kvxe4-joccp-pgapo-vpcvb-zxtmq-oae'. This must cover the developerAddress constant/variable declaration, any function bodies, inline comments, and any other location in the file. After the change, zero occurrences of the substring 'f2ba368d' must remain anywhere in the file.",
      "reqIds": [
        "REQ-20"
      ],
      "status": "pending"
    },
    {
      "id": "AR-23",
      "summary": "In backend/main.mo, hardcode the principal 'r7e75-6gjbk-2hu53-tcwcn-gppkv-2prfn-os6xt-eocak-oy4sa-qnejo-kae' as a permanent admin. This principal must be assigned the admin role wherever initializeAccessControl sets up admin roles (or in the actor's initialization block), must survive upgrades and re-deployments, and must not be removable through any access control function. Existing roles and access control assignments must not be disturbed.",
      "reqIds": [
        "REQ-21"
      ],
      "status": "pending"
    },
    {
      "id": "AR-24",
      "summary": "Verify that all other critical constants and functionality in backend/main.mo remain completely unchanged after applying REQ-19 through REQ-21: MINT_FEE_AMOUNT=1_000_000_000, MIN_TOTAL_TAX=25, MAX_TOTAL_TAX=2500, PAYMENT_VALIDITY_WINDOW=3_600_000_000_000, TOKEN_CREATION_RATE_LIMIT=30_000_000_000, all six tax mechanisms (treasury, burn, reflection, liquidity, yield, support), x404 payment rails (150 BPS additive), ICRC-2 approve/transferFrom fee collection, rate limiting, input sanitization, getTokenCount(), getTreasuryAddress(), getCreationFee(), getAllTokens(), and the transient-keyword fix (non-stable var declarations for paymentLockMap and creationTimeMap).",
      "reqIds": [
        "REQ-22"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Digital Forge ICP",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}